In [ ]:
import pandas as pd

df=pd.read_csv("f1.csv");
print(df);

    ID        Name   Age          City   Score
0    1        Asha    23   Bhubaneswar      88
1    2       Rohan    27       Cuttack      75
2    3       Meera    22          Puri      91
3    4       Arjun    25     Sambalpur      67
4    5       Priya    24      Balasore      80
5    6      Vikram    26      Rourkela      85
6    7        Neha    23     Berhampur      92
7    8      Aditya    28         Angul      72
8    9       Pooja    21    Jharsuguda      89
9   10       Rahul    24       Bargarh      78
10  11       Divya    25      Rayagada      86
11  12      Sanjay    27      Balangir      81
12  13        Isha    22     Dhenkanal      94
13  14      Nikhil    26        Jajpur      70
14  15      Ananya    23    Sundargarh      87
15  16       Varun    25      Nayagarh      79
16  17       Sneha    24        Ganjam      90
17  18       Harsh    28     Kendujhar      76
18  19      Ritika    21       Nuapada      93
19  20        Amar    26       Bhadrak      84
20  21       Kavya    25      Balasore      88
21  22      Deepak    27       Cuttack      77
22  23       Swati    22   Bhubaneswar      91
23  24   Siddharth    24          Puri      82
24  25      Anjali    26     Sambalpur      89

In [9]:
print(df)

   ID    Name   Age          City   Score
0   1    Asha    23   Bhubaneswar      88
1   2   Rohan    27       Cuttack      75
2   3   Meera    22          Puri      91
3   4   Arjun    25     Sambalpur      67
4   5   Priya    24      Balasore      80

In [15]:
df.index

RangeIndex(start=0, stop=25, step=1)

In [ ]:
df.head(10)   #it will provide the first 5 rows of dataframe...

   ID     Name   Age          City   Score
0   1     Asha    23   Bhubaneswar      88
1   2    Rohan    27       Cuttack      75
2   3    Meera    22          Puri      91
3   4    Arjun    25     Sambalpur      67
4   5    Priya    24      Balasore      80
5   6   Vikram    26      Rourkela      85
6   7     Neha    23     Berhampur      92
7   8   Aditya    28         Angul      72
8   9    Pooja    21    Jharsuguda      89
9  10    Rahul    24       Bargarh      78

In [17]:
df.columns

Index(['ID', ' Name', ' Age', ' City', ' Score'], dtype='object')

In [18]:
df.columns

Index(['ID', ' Name', ' Age', ' City', ' Score'], dtype='object')

In [19]:
print(df.columns.tolist())

['ID', ' Name', ' Age', ' City', ' Score']

In [21]:
df.columns

Index(['ID', ' Name', ' Age', ' City', ' Score'], dtype='object')

In [28]:
print(type(df.columns))
print(df.columns[0])

<class 'pandas.core.indexes.base.Index'>
ID

In [30]:
df.columns = df.columns.str.strip().str.replace('\xa0', '').str.encode('utf-8').str.decode('utf-8')

In [35]:
set(df["Name",""])

{' Aditya',
 ' Amar',
 ' Ananya',
 ' Anjali',
 ' Arjun',
 ' Asha',
 ' Deepak',
 ' Divya',
 ' Harsh',
 ' Isha',
 ' Kavya',
 ' Meera',
 ' Neha',
 ' Nikhil',
 ' Pooja',
 ' Priya',
 ' Rahul',
 ' Ritika',
 ' Rohan',
 ' Sanjay',
 ' Siddharth',
 ' Sneha',
 ' Swati',
 ' Varun',
 ' Vikram'}

In [38]:
df.columns.tolist()

['ID', 'Name', 'Age', 'City', 'Score']

In [41]:
df[["Name","City","Score"]]

          Name          City  Score
0         Asha   Bhubaneswar     88
1        Rohan       Cuttack     75
2        Meera          Puri     91
3        Arjun     Sambalpur     67
4        Priya      Balasore     80
5       Vikram      Rourkela     85
6         Neha     Berhampur     92
7       Aditya         Angul     72
8        Pooja    Jharsuguda     89
9        Rahul       Bargarh     78
10       Divya      Rayagada     86
11      Sanjay      Balangir     81
12        Isha     Dhenkanal     94
13      Nikhil        Jajpur     70
14      Ananya    Sundargarh     87
15       Varun      Nayagarh     79
16       Sneha        Ganjam     90
17       Harsh     Kendujhar     76
18      Ritika       Nuapada     93
19        Amar       Bhadrak     84
20       Kavya      Balasore     88
21      Deepak       Cuttack     77
22       Swati   Bhubaneswar     91
23   Siddharth          Puri     82
24      Anjali     Sambalpur     89

In [49]:
list(df.iloc[10])

KeyError: 11

In [ ]:
df.columns

    ID Name  Age City  Score
0  NaN  NaN  NaN  NaN    NaN
1  NaN  NaN  NaN  NaN    NaN
2  NaN  NaN  NaN  NaN    NaN
3  NaN  NaN  NaN  NaN    NaN
4  NaN  NaN  NaN  NaN    NaN
5  NaN  NaN  NaN  NaN    NaN
6  NaN  NaN  NaN  NaN    NaN
7  NaN  NaN  NaN  NaN    NaN
8  NaN  NaN  NaN  NaN    NaN
9  NaN  NaN  NaN  NaN    NaN
10 NaN  NaN  NaN  NaN    NaN
11 NaN  NaN  NaN  NaN    NaN
12 NaN  NaN  NaN  NaN    NaN
13 NaN  NaN  NaN  NaN    NaN
14 NaN  NaN  NaN  NaN    NaN
15 NaN  NaN  NaN  NaN    NaN
16 NaN  NaN  NaN  NaN    NaN
17 NaN  NaN  NaN  NaN    NaN
18 NaN  NaN  NaN  NaN    NaN
19 NaN  NaN  NaN  NaN    NaN
20 NaN  NaN  NaN  NaN    NaN
21 NaN  NaN  NaN  NaN    NaN
22 NaN  NaN  NaN  NaN    NaN
23 NaN  NaN  NaN  NaN    NaN
24 NaN  NaN  NaN  NaN    NaN

In [52]:
df.columns.tolist()

['ID', 'Name', 'Age', 'City', 'Score']

In [70]:
print(df[(df["Name"]=='Varun')|
(df["City"]=='Nayagarh')])

Empty DataFrame
Columns: [ID, Name, Age, City, Score]
Index: []

In [11]:
df[(df[" Name"]==" Varun") & (df[" City"]==" Nayagarh")]

    ID    Name   Age       City   Score
15  16   Varun    25   Nayagarh      79

In [2]:
df.columns.tolist()

NameError: name 'df' is not defined

In [4]:
df.head()

   ID    Name   Age          City   Score
0   1    Asha    23   Bhubaneswar      88
1   2   Rohan    27       Cuttack      75
2   3   Meera    22          Puri      91
3   4   Arjun    25     Sambalpur      67
4   5   Priya    24      Balasore      80

 df[df["age"]>25]

In [9]:
df[df[" Age"]>25]

    ID     Name   Age        City   Score
1    2    Rohan    27     Cuttack      75
5    6   Vikram    26    Rourkela      85
7    8   Aditya    28       Angul      72
11  12   Sanjay    27    Balangir      81
13  14   Nikhil    26      Jajpur      70
17  18    Harsh    28   Kendujhar      76
19  20     Amar    26     Bhadrak      84
21  22   Deepak    27     Cuttack      77
24  25   Anjali    26   Sambalpur      89

In [13]:
df[df[" Name"].str.startswith(" A")]

    ID     Name   Age          City   Score
0    1     Asha    23   Bhubaneswar      88
3    4    Arjun    25     Sambalpur      67
7    8   Aditya    28         Angul      72
14  15   Ananya    23    Sundargarh      87
19  20     Amar    26       Bhadrak      84
24  25   Anjali    26     Sambalpur      89

In [30]:
df[df[" Name"].str.startswith(" N")]

    ID     Name   Age        City   Score
6    7     Neha    23   Berhampur      92
13  14   Nikhil    26      Jajpur      70

In [31]:
df[~df[" City"].str.startswith(" A").isin([" Cuttak"," Puri"])]

    ID        Name   Age          City   Score
0    1        Asha    23   Bhubaneswar      88
1    2       Rohan    27       Cuttack      75
2    3       Meera    22          Puri      91
3    4       Arjun    25     Sambalpur      67
4    5       Priya    24      Balasore      80
5    6      Vikram    26      Rourkela      85
6    7        Neha    23     Berhampur      92
7    8      Aditya    28         Angul      72
8    9       Pooja    21    Jharsuguda      89
9   10       Rahul    24       Bargarh      78
10  11       Divya    25      Rayagada      86
11  12      Sanjay    27      Balangir      81
12  13        Isha    22     Dhenkanal      94
13  14      Nikhil    26        Jajpur      70
14  15      Ananya    23    Sundargarh      87
15  16       Varun    25      Nayagarh      79
16  17       Sneha    24        Ganjam      90
17  18       Harsh    28     Kendujhar      76
18  19      Ritika    21       Nuapada      93
19  20        Amar    26       Bhadrak      84
20  21       Kavya    25      Balasore      88
21  22      Deepak    27       Cuttack      77
22  23       Swati    22   Bhubaneswar      91
23  24   Siddharth    24          Puri      82
24  25      Anjali    26     Sambalpur      89

In [34]:
df.loc[df[" Name"]==" Amar","Age"]=90

In [ ]:
df.loc[df[" Name"]==" Asha"]

   ID   Name   Age          City   Score   Age
0   1   Asha    23   Bhubaneswar      88  90.0

In [ ]:
df[" City"]=df[" City"].str.strip()

In [ ]:
df[" City"]

0     Bhubaneswar
1         Cuttack
2            Puri
3       Sambalpur
4        Balasore
5        Rourkela
6       Berhampur
7           Angul
8      Jharsuguda
9         Bargarh
10       Rayagada
11       Balangir
12      Dhenkanal
13         Jajpur
14     Sundargarh
15       Nayagarh
16         Ganjam
17      Kendujhar
18        Nuapada
19        Bhadrak
20       Balasore
21        Cuttack
22    Bhubaneswar
23           Puri
24      Sambalpur
Name:  City, dtype: object

In [ ]:
df=df.drop(1)

In [1]:
df.dropna()
df.fillna({"ID":0},inplace=True)

NameError: name 'df' is not defined

In [ ]:
df.rename(columns={" ID":"ID"},inplace=True)

In [2]:
df.rename(columns={" Name":"Name"},inplace=True)

NameError: name 'df' is not defined

In [ ]:
df.groupby("Age")[" Age"].sum()

Age
90.0    23
Name:  Age, dtype: int64

In [ ]:
df.loc[df["Name"]=="Rohan"]

Empty DataFrame
Columns: [ID, Name,  Age,  City,  Score, Age]
Index: []

In [38]:
df.to_csv("file2.csv",index=True)